#include <stdio.h>
int main()
{
	int g,i,k,s,a[10];//定义四个变量及一个数组，数组用来表示式中的每一个口 
    long m1,m2,m3;//定义三个长整型变量m1,m2,m3作为为分母 
    printf("桥本分数式有:\n");
	i=1;//初始化i=1 
	a[1]=1;//初始化a[1]=1 
	s=0;//初始化s=0 
	while (1)//判断条件为真，只要不是“0”，这个循环就一直循环下去
   	{
   		g=1;//令g=1 
    	for(k=i-1;k>=1;k--)//for循环的条件是当k=i-1,也就是当k=9，k>=1,k-- 
    	{
      		if(a[i]==a[k]) //当 a[i]==a[k]，即两个数相同,标记g=0  
			{
				g=0;
				break;
			}
		}      
    	if(i==9 && g==1 && a[1]<a[4])//令a[1]<a[4]主要是为了避免重复 ， 比如a/bc+f/de=g/hi和 f/de+a/bc=g/hi是相同的 
     	{ 
		 	m1=a[2]*10+a[3];//第一个分母= a[2]*10+a[3]
			m2=a[5]*10+a[6];//第二个分母 =a[5]*10+a[6]
			m3=a[8]*10+a[9];//第三个分母=a[8]*10+a[9]
            if(a[1]*m2*m3+a[4]*m1*m3==a[7]*m1*m2)  // 判断等式  
            {
				s++;//等式成立，s加 1 
				printf("(%2d) ",s);//输出s 
				printf("%d/%ld+%d/",a[1],m1,a[4]);
				printf("%ld=%d/%ld   ",m2,a[7],m3);
		    if(s%2==0) 
				printf("\n");
		    }
		}
  		if(i< 9 && g==1) 
	{
		i++;
		a[i]=1;
		continue;
	} // 不到9个数,往后继续  
	while(a[i]==9 && i>1)
		i--;   // 往前回溯  
	if(a[i]==9 && i==1) 
		break;
	else 
		a[i]++;   // 至第1个数为9结束  
	}
	printf("  共以上%d个解。\n",s);
}
